

# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P2/4 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 6, C2f, [128, True]]
  - [-1, 1, simam, []]
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 3, C2fPSA, [256]]
  - [-1, 1, simam, []]
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 3, SwinTransformer, [512, True]]
  - [-1, 1, simam, []]
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 12
  - [-1, 2, C2PSA, [1024]]
  - [-1, 1, simam, []]        #14

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 20 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, C3k2, [128, False]] # 23 (P2/4-xsmall)
  - [-1, 1, simam, []]    #24
  
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 20], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 26 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 29 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3TR, [1024]] # 32 (P5/32-large)

  - [[24, 26, 29, 32], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
