# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f, [1024, True]]       # 8

  # 🔹 INSERT AIFI HERE
  - [-1, 1, AIFI, [1024, 2048, 8]]   # 9 - AIFI Layer with [c1, cm, num_heads]

  - [-1, 1, SPPF, [1024, 5]]         # 10 - Now becomes input to SPPF

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 11
  - [[-1, 6], 1, Concat, [1]]                       # 12 - cat backbone P4
  - [-1, 3, C2f, [512]]                             # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 14
  - [[-1, 4], 1, Concat, [1]]                       # 15 - cat backbone P3
  - [-1, 3, C2f, [256]]                             # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                      # 17
  - [[-1, 13], 1, Concat, [1]]                      # 18 - cat head P4
  - [-1, 3, C2f, [512]]                             # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                      # 20
  - [[-1, 10], 1, Concat, [1]]                      # 21 - cat head P5
  - [-1, 3, C2f, [1024]]                            # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]                # 23 - Detect(P3, P4, P5)
