nc: 7

backbone:

  - [-1, 1, SCDPatchEmbed, [48, 4]]

  - [-1, 1, SCDMambaStage, [2]]

  - [-1, 1, SCDPatchMerge, []]

  - [-1, 1, SCDMambaStage, [2]]

  - [-1, 1, SCDPatchMerge, []]

  - [-1, 1, SCDMambaStage, [4]]

  - [-1, 1, SCDPatchMerge, []]

  - [-1, 1, SCDMambaStage, [2]]

  - [-1, 1, SPPF, [192, 5]]

  - [-1, 1, SCDAspp, [192]]

  - [[3,5,9], 1, SCDBiFPN, [192]]

  - [-1, 1, SCDBiFPN, [192]]

head:

  - [11, 1, Index, [0]]
  - [11, 1, Index, [1]]
  - [11, 1, Index, [2]]

  - [[12,13,14], 1, Detect, [nc]]
