# PhaseYOLO — Physics-Informed Dual-Stream Architecture
# for RBC Oxygenation Classification in Digital Holographic Microscopy

nc: 3
ch: 1

scales:
  holo: [0.67, 1.0, 256]

# ───────────────── BACKBONE ─────────────────
backbone:

  # 0 DualStreamStem (Spatial + Phase stream)
  - [-1, 1, DualStreamStem, [1, 16, 128]]

  # 1 FIRST CONV (FIXED FOR GRAYSCALE INPUT)
  - [-1, 1, Conv, [32, 3, 2]]

  # 2
  - [-1, 3, C2f, [32, True]]

  # 3
  - [-1, 1, Conv, [64, 3, 2]]

  # 4  ← P3
  - [-1, 6, C2f, [64, True]]

  # 5 PhaseGate P3
  - [-1, 1, PhaseGate, [128]]

  # 6
  - [-1, 1, Conv, [128, 3, 2]]

  # 7  ← P4
  - [-1, 6, C2f, [128, True]]

  # 8 PhaseGate P4
  - [-1, 1, PhaseGate, [128]]

  # 9
  - [-1, 1, Conv, [256, 3, 2]]

  # 10
  - [-1, 3, C2f, [256, True]]

  # 11
  - [-1, 1, HoloSPPF, [256, 5]]

  # 12
  - [-1, 1, SwinTransformer, [256, 4, 4]]

  # 13 PhaseGate P5
  - [-1, 1, PhaseGate, [128]]

# ───────────────── HEAD ─────────────────
head:

  # 14
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]

  # 15
  - [[-1, 7], 1, Concat, [1]]

  # 16
  - [-1, 2, DeformC2f, [128, False]]

  # 17
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]

  # 18
  - [[-1, 4], 1, Concat, [1]]

  # 19  ← P3 output
  - [-1, 2, DeformC2f, [64, False]]

  # 20
  - [-1, 1, Conv, [64, 3, 2]]

  # 21
  - [[-1, 16], 1, Concat, [1]]

  # 22  ← P4 output
  - [-1, 1, C2f, [128, False]]

  # 23
  - [-1, 1, Conv, [128, 3, 2]]

  # 24
  - [[-1, 13], 1, Concat, [1]]

  # 25  ← P5 output
  - [-1, 1, C2f, [256, False]]

  # 26 HoloDetect
  - [[19, 22, 25], 1, Detect, [nc]]
