# ══════════════════════════════════════════════════════════════════════════════
# PhaseYOLO — Novel Physics-Informed Dual-Stream Architecture
# for RBC Oxygenation Classification in Digital Holographic Microscopy
# ══════════════════════════════════════════════════════════════════════════════
#
# NOVEL CONTRIBUTIONS (for publication):
#
# 1. Dual-Stream Backbone
#    Stream A (spatial):  GaborStem → Conv/C2f pyramid → HoloSPPF → SwinT
#    Stream B (phase):    GaborPyramid on raw image → 128-dim phase embedding
#    No prior DHM detection paper uses an explicit phase-texture stream.
#
# 2. PhaseGate Fusion
#    Phase embedding gates spatial channels at P3, P4, P5.
#    Physics → spatial information bridge.
#    Lets the backbone know WHICH features encode morphology.
#
# 3. HoloDetect Head
#    3×Conv3×3 + GAP + Linear classification branch (vs vanilla 2×DWConv).
#    Dedicated spatial reasoning for intra-class morphology discrimination.
#
# 4. OrdinalMorphLoss
#    healthy < normoxia < hypoxia severity ordering encoded into loss.
#    Penalises healthy→hypoxia (distance=2) more than healthy→normoxia (=1).
#
# ── Channel trace (width=1.0, depth=0.67, max_channels=256) ──────────────────
#   Layer  0  DualStreamStem        ch_out=16   Stream A spatial + Stream B phase
#   Layer  1  Conv  [32, 3, 2]      ch_out=32
#   Layer  2  C2f   [32]    n=2     ch_out=32
#   Layer  3  Conv  [64, 3, 2]      ch_out=64
#   Layer  4  C2f   [64]    n=4     ch_out=64   ← P3 save
#   Layer  5  PhaseGate [64, 128]   ch_out=64   phase gates P3 channels
#   Layer  6  Conv  [128, 3, 2]     ch_out=128
#   Layer  7  C2f   [128]   n=4     ch_out=128  ← P4 save
#   Layer  8  PhaseGate [128, 128]  ch_out=128  phase gates P4 channels
#   Layer  9  Conv  [256, 3, 2]     ch_out=256
#   Layer 10  C2f   [256]   n=2     ch_out=256
#   Layer 11  HoloSPPF [256, 5]     ch_out=256
#   Layer 12  SwinTransformer       ch_out=256  global ring attention
#   Layer 13  PhaseGate [256, 128]  ch_out=256  phase gates P5 channels ← P5 save
#
#   HEAD:
#   Layer 14  Upsample              ch_out=256
#   Layer 15  Concat[-1, 7]         ch_out=384  (256+128) fuse P5+P4
#   Layer 16  DeformC2f [128] n=2   ch_out=128
#   Layer 17  Upsample              ch_out=128
#   Layer 18  Concat[-1, 4]         ch_out=192  (128+64) fuse P4+P3
#   Layer 19  DeformC2f [64]  n=2   ch_out=64
#   Layer 20  Conv [64, 3, 2]       ch_out=64
#   Layer 21  Concat[-1, 16]        ch_out=192  (64+128)
#   Layer 22  C2f  [128]            ch_out=128
#   Layer 23  Conv [128, 3, 2]      ch_out=128
#   Layer 24  Concat[-1, 13]        ch_out=384  (128+256)
#   Layer 25  C2f  [256]            ch_out=256
#   Layer 26  HoloDetect            P3(19)=64, P4(22)=128, P5(25)=256
#
# ── tasks.py additions needed ─────────────────────────────────────────────────
#   Run apply_phaseyolo_patch.py once to add DualStreamStem, PhaseGate,
#   HoloDetect to parse_model branches.
#   DualStreamStem: same branch as GaborStem (c2=args[1], args=[args[1],ch[f]])
#   PhaseGate: simple pass-through branch (c2=ch[f], args unchanged)
#   HoloDetect: same branch as Detect

nc: 3    # 0=healthy, 1=normoxia, 2=hypoxia
ch: 1    # grayscale hologram

scales:
  holo: [0.67, 1.0, 256]

# ── Backbone ──────────────────────────────────────────────────────────────────
backbone:

  # Layer 0 — DualStreamStem
  # Stream A: GaborStem(1→16) — spatial features
  # Stream B: GaborPyramid(1→128) — phase embedding cached for PhaseGate
  # args: [in_channels, out_channels, phase_dim]
  # tasks.py DualStreamStem branch: c2=args[1]=16
  - [-1, 1, DualStreamStem, [1, 16, 128]]    # ch_out=16, H/2 × W/2

  # Layer 1
  - [-1, 1, Conv,            [32, 3, 2]]     # ch_out=32, H/4 × W/4

  # Layer 2 — n=round(3×0.67)=2
  - [-1, 3, C2f,             [32, True]]     # ch_out=32, n=2

  # Layer 3
  - [-1, 1, Conv,            [64, 3, 2]]     # ch_out=64, H/8 × W/8

  # Layer 4 — P3, n=round(6×0.67)=4
  - [-1, 6, C2f,             [64, True]]     # ch_out=64, n=4  ← P3

  # Layer 5 — PhaseGate at P3
  # Conditions P3 spatial channels on GaborPyramid phase embedding
  # tasks.py PhaseGate branch: c2=ch[f] (pass-through)
  # args: [spatial_ch, phase_dim] — but spatial_ch is ch[f] injected by tasks.py
  - [-1, 1, PhaseGate,       [128]]          # ch_out=64 (pass-through)

  # Layer 6
  - [-1, 1, Conv,            [128, 3, 2]]    # ch_out=128, H/16 × W/16

  # Layer 7 — P4, n=round(6×0.67)=4
  - [-1, 6, C2f,             [128, True]]    # ch_out=128, n=4  ← P4

  # Layer 8 — PhaseGate at P4
  - [-1, 1, PhaseGate,       [128]]          # ch_out=128 (pass-through)

  # Layer 9
  - [-1, 1, Conv,            [256, 3, 2]]    # ch_out=256, H/32 × W/32

  # Layer 10 — n=round(3×0.67)=2
  - [-1, 3, C2f,             [256, True]]    # ch_out=256, n=2

  # Layer 11 — HoloSPPF: annular-pool + SPPF fusion
  - [-1, 1, HoloSPPF,        [256, 5]]       # ch_out=256, H/32 × W/32

  # Layer 12 — SwinTransformer: global ring coherence attention
  # H/32 = 20×20 = 400 tokens, window_size=4
  - [-1, 1, SwinTransformer, [256, 4, 4]]    # ch_out=256, H/32 × W/32

  # Layer 13 — PhaseGate at P5  ← P5 save point
  - [-1, 1, PhaseGate,       [128]]          # ch_out=256 (pass-through)

# ── Head (PAN-FPN + HoloDetect) ───────────────────────────────────────────────
head:

  # Layer 14
  - [-1,        1, nn.Upsample, [None, 2, "nearest"]]  # ch_out=256, H/16

  # Layer 15 — concat P5(256) + P4(layer 7, ch=128)
  - [[-1, 7],   1, Concat,      [1]]                   # ch_out=384, H/16

  # Layer 16 — DeformC2f n=2: ring-aware P4 fusion
  - [-1,        2, DeformC2f,   [128, False]]           # ch_out=128, H/16

  # Layer 17
  - [-1,        1, nn.Upsample, [None, 2, "nearest"]]  # ch_out=128, H/8

  # Layer 18 — concat P4(128) + P3(layer 4, ch=64)
  - [[-1, 4],   1, Concat,      [1]]                   # ch_out=192, H/8

  # Layer 19 — DeformC2f n=2: ring-aware P3 fusion
  - [-1,        2, DeformC2f,   [64, False]]            # ch_out=64,  H/8

  # Layer 20
  - [-1,        1, Conv,        [64, 3, 2]]             # ch_out=64,  H/16

  # Layer 21 — concat with neck P4 (layer 16, ch=128)
  - [[-1, 16],  1, Concat,      [1]]                   # ch_out=192, H/16

  # Layer 22
  - [-1,        1, C2f,         [128, False]]           # ch_out=128, H/16

  # Layer 23
  - [-1,        1, Conv,        [128, 3, 2]]            # ch_out=128, H/32

  # Layer 24 — concat with P5-gated (layer 13, ch=256)
  - [[-1, 13],  1, Concat,      [1]]                   # ch_out=384, H/32

  # Layer 25
  - [-1,        1, C2f,         [256, False]]           # ch_out=256, H/32

  # Layer 26 — HoloDetect: deep cls branch (3×Conv3×3 + GAP + Linear)
  # P3(19)=64ch, P4(22)=128ch, P5(25)=256ch
  - [[19, 22, 25], 1, HoloDetect, [nc]]
