# WaveYOLO — fixed YAML
# ultralytics/cfg/models/v8/waveyolo.yaml

nc: 3
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75,  768]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.25,  512]

# ── Backbone ──────────────────────────────────────────────────────────────────
# [from, repeats, module, args]
backbone:
  - [-1, 1, Conv,          [64, 3, 2]]          #  0  P1/2
  - [-1, 1, AnnularDWConv, [64, 7, 2, 3]]       #  1  ring stem
  - [-1, 1, Conv,          [128, 3, 2]]          #  2  P2/4
  - [-1, 3, C2f_Ring,      [128, True]]          #  3
  - [-1, 1, Conv,          [256, 3, 2]]          #  4  P3/8
  - [-1, 6, C2f_Ring,      [256, True]]          #  5  ← P3 save
  - [-1, 1, Conv,          [512, 3, 2]]          #  6  P4/16
  - [-1, 6, C2f_Ring,      [512, True]]          #  7  ← P4 save
  - [-1, 1, Conv,          [1024, 3, 2]]         #  8  P5/32
  - [-1, 3, C2f_Ring,      [1024, True]]         #  9
  - [-1, 1, PSARadial,     [1024]]               # 10  ← P5 save

# ── Neck ──────────────────────────────────────────────────────────────────────
head:
  - [-1,  1, nn.Upsample,  [None, 2, 'nearest']] # 11  upsample P5
  - [[-1, 7], 1, Concat,   [1]]                  # 12  cat P4  → 1024+512=1536
  - [-1,  3, C2f_Ring,     [512, False]]          # 13  ← N4 save

  - [-1,  1, nn.Upsample,  [None, 2, 'nearest']] # 14  upsample N4
  - [[-1, 5], 1, Concat,   [1]]                  # 15  cat P3  → 512+256=768
  - [-1,  3, C2f_Ring,     [256, False]]          # 16  ← N3  (P3 output)

  - [-1,  1, Conv,         [256, 3, 2]]           # 17  downsample
  - [[-1, 13], 1, Concat,  [1]]                   # 18  cat N4  → 256+512=768
  - [-1,  3, C2f_Ring,     [512, False]]           # 19  ← N4  (P4 output)

  - [-1,  1, Conv,         [512, 3, 2]]            # 20  downsample
  - [[-1, 10], 1, Concat,  [1]]                    # 21  cat P5  → 512+1024=1536
  - [-1,  3, C2f_Ring,     [1024, False]]          # 22  ← N5  (P5 output)

  - [[16, 19, 22], 1, Detect, [nc]]               # 23  Detect head
