# WaveYOLO model config
# File location: ultralytics/cfg/models/v8/waveyolo.yaml  (NEW FILE)
#
# Usage:
#   from ultralytics import YOLO
#   model = YOLO('waveyolo.yaml')
#
# Scales (n/s/m/l/x) mirror YOLOv8 depth/width/max_channels:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768 ]
#   l: [1.00, 1.00, 512 ]
#   x: [1.00, 1.25, 512 ]

nc: 1        # ← set your number of classes here
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75,  768]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.25,  512]

# ── Backbone ─────────────────────────────────────────────────────────────────
# [from, repeats, module, args]
backbone:
  - [-1, 1, Conv,          [64, 3, 2]]          #  0 P1/2  — standard stem
  - [-1, 1, AnnularDWConv, [64, 7, 2, 3]]       #  1       — ring-sensitive stem (NEW)
  - [-1, 1, Conv,          [128, 3, 2]]          #  2 P2/4
  - [-1, 3, C2f_Ring,      [128, True]]          #  3       (NEW)
  - [-1, 1, Conv,          [256, 3, 2]]          #  4 P3/8
  - [-1, 6, C2f_Ring,      [256, True]]          #  5       (NEW)  ← save as P3
  - [-1, 1, Conv,          [512, 3, 2]]          #  6 P4/16
  - [-1, 6, C2f_Ring,      [512, True]]          #  7       (NEW)  ← save as P4
  - [-1, 1, Conv,          [1024, 3, 2]]         #  8 P5/32
  - [-1, 3, C2f_Ring,      [1024, True]]         #  9       (NEW)
  - [-1, 1, PSARadial,     [1024]]               # 10       — polar attn (NEW)

# ── Neck (WaveFPN + BiFPN-style) ─────────────────────────────────────────────
neck:
  - [-1, 1, nn.Upsample,   [None, 2, 'nearest']] # 11
  - [[-1, 7], 1, WaveFPN,  [512]]                # 12 — wavelet fuse P5↑ + P4 (NEW)
  - [-1, 3, C2f_Ring,      [512, False]]         # 13

  - [-1, 1, nn.Upsample,   [None, 2, 'nearest']] # 14
  - [[-1, 5], 1, WaveFPN,  [256]]                # 15 — wavelet fuse P4↑ + P3 (NEW)
  - [-1, 3, C2f_Ring,      [256, False]]         # 16  ← P3 output

  - [-1, 1, Conv,          [256, 3, 2]]          # 17
  - [[-1, 13], 1, Concat,  [1]]                  # 18
  - [-1, 3, C2f_Ring,      [512, False]]         # 19  ← P4 output

  - [-1, 1, Conv,          [512, 3, 2]]          # 20
  - [[-1, 10], 1, Concat,  [1]]                  # 21
  - [-1, 3, C2f_Ring,      [1024, False]]        # 22  ← P5 output

# ── Head ─────────────────────────────────────────────────────────────────────
head:
  - [[16, 19, 22], 1, Detect, [nc]]              # 23 — decoupled detect head
  # ↑ swap Detect → OBB if you need oriented bbox (see ultralytics OBB head)
