# TB-SOD Maximum Performance Architecture
# CBAM + SCDAspp + C2PSA + SCDSwinStage backbone
# P2/P3/P4/P5 four-scale detection head

nc: 1

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1  P2/4  <- skip connection for P2 head
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, CBAM, []]                     # 5  suppress staining artifacts @ P3
  - [-1, 1, Conv, [512, 3, 2]]            # 6  P4/16
  - [-1, 2, C3k2, [512, True]]            # 7
  - [-1, 1, CBAM, []]                     # 8  suppress artifacts @ P4
  - [-1, 1, Conv, [1024, 3, 2]]           # 9  P5/32
  - [-1, 2, C3k2, [1024, True]]           # 10
  - [-1, 1, SPPF, [1024, 5]]              # 11
  - [-1, 1, SCDAspp, [1024]]              # 12 ASPP multi-scale dilation
  - [-1, 2, C2PSA, [1024]]               # 13 position-sensitive attention
  - [-1, 1, SCDSwinStage, [8, 2]]         # 14 window attention for cluster patterns

head:
  # Top-down path P5 -> P4 -> P3 -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15  P5 up
  - [[-1, 8], 1, Concat, [1]]                     # 16  fuse P4 CBAM features
  - [-1, 2, C3k2, [512, False]]                   # 17  P4 top-down

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18  P4 up
  - [[-1, 5], 1, Concat, [1]]                     # 19  fuse P3 CBAM features
  - [-1, 2, C3k2, [256, False]]                   # 20  P3 top-down

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 21  P3 up
  - [[-1, 1], 1, Concat, [1]]                     # 22  fuse P2/4 backbone skip
  - [-1, 2, C3k2, [128, False]]                   # 23  P2/4-tiny detection branch

  # Bottom-up path P2 -> P3 -> P4 -> P5
  - [-1, 1, Conv, [128, 3, 2]]                    # 24  P2 down
  - [[-1, 20], 1, Concat, [1]]                    # 25  fuse P3 top-down
  - [-1, 2, C3k2, [256, False]]                   # 26  P3/8-small (PRIMARY for TB)

  - [-1, 1, Conv, [256, 3, 2]]                    # 27  P3 down
  - [[-1, 17], 1, Concat, [1]]                    # 28  fuse P4 top-down
  - [-1, 2, C3k2, [512, False]]                   # 29  P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]                    # 30  P4 down
  - [[-1, 14], 1, Concat, [1]]                    # 31  fuse P5 Swin output
  - [-1, 2, C3k2, [1024, True]]                   # 32  P5/32-large

  - [[23, 26, 29, 32], 1, Detect, [nc]]           # 33  Detect(P2,P3,P4,P5)
