nc: 1

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, CBAM, []]                   # 5  attention @ P3
  - [-1, 1, Conv, [512, 3, 2]]          # 6  P4/16
  - [-1, 2, C3k2, [512, True]]          # 7
  - [-1, 1, CBAM, []]                   # 8  attention @ P4
  - [-1, 1, Conv, [1024, 3, 2]]         # 9  P5/32
  - [-1, 2, C3k2, [1024, True]]         # 10
  - [-1, 1, SPPF, [1024, 5]]            # 11
  - [-1, 1, SCDAspp, [1024]]            # 12 ASPP multi-scale context
  - [-1, 2, C2PSA, [1024]]              # 13 PSA attention
  - [-1, 1, SCDSwinStage, [8, 2]]       # 14 Swin transformer @ P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 8], 1, Concat, [1]]                    # 16 fuse P4
  - [-1, 2, C3k2, [512, False]]                  # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 5], 1, Concat, [1]]                    # 19 fuse P3
  - [-1, 2, C3k2, [256, False]]                  # 20

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 21
  - [[-1, 1], 1, Concat, [1]]                    # 22 fuse P2
  - [-1, 2, C3k2, [128, False]]                  # 23 P2/4-tiny

  - [-1, 1, Conv, [128, 3, 2]]                   # 24
  - [[-1, 20], 1, Concat, [1]]                   # 25
  - [-1, 2, C3k2, [256, False]]                  # 26 P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                   # 27
  - [[-1, 17], 1, Concat, [1]]                   # 28
  - [-1, 2, C3k2, [512, False]]                  # 29 P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]                   # 30
  - [[-1, 14], 1, Concat, [1]]                   # 31
  - [-1, 2, C3k2, [1024, True]]                  # 32 P5/32-large

  - [[23, 26, 29, 32], 1, Detect, [nc]]          # 33 Detect(P2,P3,P4,P5)
