# TB-SOD Maximum Performance Architecture v2
# ─────────────────────────────────────────────────────────────────────────────
# Backbone  : CNN + CBAM@P3+P4 + SCDAspp + C2PSA + SCDSwinStage + SCDMambaStage
# Neck      : Enhanced PAN with CBAM@P4, SCDSwinStage@P3, SCDAspp@P3
# Head      : P2 / P3 / P4 / P5  four-scale Detect
#
# Design rationale per scale  (all verified at width=0.50, depth=0.50):
#   P5  – SCDSwinStage captures cluster context; SCDMambaStage adds rod-
#          orientation sequential modelling; SCDAspp handles multi-dilation.
#   P3  – PRIMARY bacilli scale (4-20 px after resize). Gets SCDSwinStage +
#          SCDAspp in the neck, then a final CBAM before the detect head.
#   P2  – Tiny / touching bacilli; fused from P3 + backbone P2 skip.
#   P4/5– Large aggregates and field-of-view context.
#
# Channel counts at scale  s  (width=0.50, depth=0.50, max_channels=1024):
#   Layer  1  : 64 ch   (P2 skip)
#   Layer  5  : 256 ch  (P3 CBAM backbone)
#   Layer  8  : 256 ch  (P4 CBAM backbone)
#   Layer 15  : 512 ch  (P5 Mamba)
#   Detect feeds: 64 / 128 / 256 / 512
# ─────────────────────────────────────────────────────────────────────────────

nc: 1

scales:
  # [depth_multiple, width_multiple, max_channels]
  n: [0.50, 0.50, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]

  # ── Stem ────────────────────────────────────────────────────────────────
  - [-1, 1, Conv,    [64,  3, 2]]           # 0   P1/2  → 32 ch
  - [-1, 1, Conv,    [128, 3, 2]]           # 1   P2/4  → 64 ch  ← P2 skip

  # ── P3 block ────────────────────────────────────────────────────────────
  - [-1, 2, C3k2,   [256, False, 0.25]]     # 2         → 128 ch
  - [-1, 1, Conv,    [256, 3, 2]]           # 3   P3/8  → 128 ch
  - [-1, 2, C3k2,   [512, False, 0.25]]     # 4         → 256 ch
  - [-1, 1, CBAM,   []]                     # 5   P3 CBAM — suppresses ZN staining artefacts

  # ── P4 block ────────────────────────────────────────────────────────────
  - [-1, 1, Conv,    [512, 3, 2]]           # 6   P4/16 → 256 ch
  - [-1, 2, C3k2,   [512, True]]            # 7         → 256 ch
  - [-1, 1, CBAM,   []]                     # 8   P4 CBAM — suppresses background debris

  # ── P5 block: full attention stack ──────────────────────────────────────
  - [-1, 1, Conv,    [1024, 3, 2]]          # 9   P5/32 → 512 ch
  - [-1, 2, C3k2,   [1024, True]]           # 10        → 512 ch
  - [-1, 1, SPPF,   [1024, 5]]             # 11        → 512 ch  global context
  - [-1, 1, SCDAspp, [1024]]               # 12 ASPP   → 512 ch  multi-dilation (fringe rings)
  - [-1, 2, C2PSA,  [1024]]               # 13 PSA    → 512 ch  position-sensitive attn
  - [-1, 1, SCDSwinStage, [8, 2]]          # 14 Swin   → 512 ch  window attn for cluster patterns
  - [-1, 1, SCDMambaStage, [2]]            # 15 Mamba  → 512 ch  sequential rod-orientation context


head:
  # ═══════════════════════════════════════════════════════════════════════
  #  TOP-DOWN PATHWAY   P5 → P4 → P3 → P2
  # ═══════════════════════════════════════════════════════════════════════

  # P5 → P4
  - [-1,       1, nn.Upsample, [None, 2, "nearest"]]  # 16  upsample P5     → 512 ch
  - [[-1, 8],  1, Concat,      [1]]                   # 17  + P4 CBAM       → 768 ch
  - [-1,       2, C3k2,        [512, False]]           # 18  P4 top-down     → 256 ch
  - [-1,       1, CBAM,        []]                     # 19  P4 attn (debris suppression)

  # P4 → P3
  - [-1,       1, nn.Upsample, [None, 2, "nearest"]]  # 20  upsample P4     → 256 ch
  - [[-1, 5],  1, Concat,      [1]]                   # 21  + P3 CBAM       → 512 ch
  - [-1,       2, C3k2,        [256, False]]           # 22  P3 top-down     → 128 ch
  - [-1,       1, SCDSwinStage, [8, 2]]               # 23  Swin@P3 — primary bacilli scale
  - [-1,       1, SCDAspp,     [256]]                 # 24  ASPP@P3 — handles rod size spread

  # P3 → P2
  - [-1,       1, nn.Upsample, [None, 2, "nearest"]]  # 25  upsample P3     → 128 ch
  - [[-1, 1],  1, Concat,      [1]]                   # 26  + P2 skip       → 192 ch
  - [-1,       2, C3k2,        [128, False]]           # 27  P2 tiny branch  →  64 ch

  # ═══════════════════════════════════════════════════════════════════════
  #  BOTTOM-UP PATHWAY  P2 → P3 → P4 → P5
  # ═══════════════════════════════════════════════════════════════════════

  # P2 → P3
  - [-1,        1, Conv,  [128, 3, 2]]                # 28  P2 downsample   →  64 ch
  - [[-1, 24],  1, Concat, [1]]                       # 29  + P3 ASPP out   → 192 ch
  - [-1,        2, C3k2,   [256, False]]              # 30  P3 final        → 128 ch
  - [-1,        1, CBAM,   []]                        # 31  P3 final attn   ← PRIMARY DET SCALE

  # P3 → P4
  - [-1,        1, Conv,  [256, 3, 2]]                # 32  P3 downsample   → 128 ch
  - [[-1, 19],  1, Concat, [1]]                       # 33  + P4 attn       → 384 ch
  - [-1,        2, C3k2,   [512, False]]              # 34  P4 final        → 256 ch

  # P4 → P5
  - [-1,        1, Conv,  [512, 3, 2]]                # 35  P4 downsample   → 256 ch
  - [[-1, 15],  1, Concat, [1]]                       # 36  + P5 Mamba      → 768 ch
  - [-1,        2, C3k2,   [1024, True]]              # 37  P5 final        → 512 ch

  # ═══════════════════════════════════════════════════════════════════════
  #  DETECT HEAD    P2 | P3 | P4 | P5
  # ═══════════════════════════════════════════════════════════════════════
  - [[27, 31, 34, 37], 1, Detect, [nc]]               # 38  4-scale Detect
