nc: 3
ch: 1

backbone:
  - [-1, 1, Conv, [32,3,2]]          # 0
  - [-1, 1, DSC2f, [64]]             # 1

  - [-1, 1, Conv, [128,3,2]]         # 2
  - [-1, 2, DSC2f, [128]]            # 3

  - [-1, 1, SimAM, [128]]            # 4
  - [-1, 1, FringeBlock, [128]]      # 5

  - [-1, 1, Conv, [256,3,2]]         # 6
  - [-1, 2, DSC2f, [256]]            # 7

  - [-1, 1, SPPF, [256,5]]           # 8


neck:
  - [-1, 1, Conv, [128,1,1]]         # 9
  - [-1, 1, Upsample, [None,2,nearest]] # 10
  - [[-1,5], 1, Concat, [1]]         # 11
  - [-1, 2, DSC2f, [128]]            # 12   (P4)

  - [-1, 1, Conv, [64,1,1]]          # 13
  - [-1, 1, Upsample, [None,2,nearest]] # 14
  - [[-1,1], 1, Concat, [1]]         # 15
  - [-1, 2, DSC2f, [64]]             # 16   (P3)


head:
  - [-1, 1, Conv, [64,3,1]]          # 17
  - [[17,12], 1, Detect, [nc]]
