nc: 3
ch: 1

backbone:

  - [-1, 1, Conv, [16, 3, 2]]        # 0
  - [-1, 1, DSC2f, [32]]             # 1
  - [-1, 1, Conv, [64, 3, 2]]        # 2
  - [-1, 1, DSC2f, [64]]             # 3
  - [-1, 1, SimAM, []]               # 4
  - [-1, 1, FringeBlock, [64]]       # 5
  - [-1, 1, Conv, [128, 3, 2]]       # 6
  - [-1, 1, DSC2f, [128]]            # 7
  - [-1, 1, SPPF, [128, 5]]          # 8

neck:

  - [-1, 1, Conv, [128, 1, 1]]       # 9
  - [-1, 1, Upsample, [None, 2, nearest]]   # 10
  - [[-1, 5], 1, Concat, [1]]        # 11
  - [-1, 1, DSC2f, [64]]             # 12

head:

  - [-1, 1, Conv, [64, 3, 1]]        # 13
  - [-1, 1, Detect, [nc]]            # 14
