nc: 3

backbone:

backbone:
  - [-1, 1, Conv, [16,3,2]]
  - [-1, 1, DSC2f, [32,1]]
  - [-1, 1, DSC2f, [64,1]]
  - [-1, 1, SimAM, []]
  - [-1, 1, FringeBlock, [64]]
  - [-1, 1, DSC2f, [128,1]]
  - [-1, 1, SPPF, [128,5]]

neck:

  - [-1, 1, Conv, [128,1,1]]
  - [-1, 1, Upsample, [None,2,'nearest']]
  - [[-1,2], 1, Concat, [1]]
  - [-1, 1, DSC2f, [64]]

head:

  - [-1, 1, Conv, [64,3,1]]
  - [-1, 1, Detect, [nc]]
