nc: 3
ch: 1

backbone:
  - [-1, 1, Conv, [32, 3, 2]]       # 0
  - [-1, 1, DSC2f, [64]]            # 1

  - [-1, 1, Conv, [128, 3, 2]]      # 2
  - [-1, 2, DSC2f, [128]]           # 3

  - [-1, 1, SimAM, [128]]           # 4
  - [-1, 1, FringeBlock, [128]]     # 5

  - [-1, 1, Conv, [256, 3, 2]]      # 6
  - [-1, 2, DSC2f, [256]]           # 7

  - [-1, 1, Conv, [512, 3, 2]]      # 8
  - [-1, 1, DSC2f, [512]]           # 9

  - [-1, 1, SPPF, [512, 5]]         # 10


neck:
  - [-1, 1, Conv, [256, 1, 1]]      # 11
  - [-1, 1, Upsample, [None, 2, nearest]]
  - [[-1, 7], 1, Concat, [1]]       # 13
  - [-1, 2, DSC2f, [256]]           # 14

  - [-1, 1, Conv, [128, 1, 1]]      # 15
  - [-1, 1, Upsample, [None, 2, nearest]]
  - [[-1, 3], 1, Concat, [1]]       # 17
  - [-1, 2, DSC2f, [128]]           # 18

  - [-1, 1, Conv, [128, 3, 2]]      # 19
  - [[-1, 14], 1, Concat, [1]]      # 20
  - [-1, 2, DSC2f, [256]]           # 21

  - [-1, 1, Conv, [256, 3, 2]]      # 22
  - [[-1, 10], 1, Concat, [1]]      # 23
  - [-1, 2, DSC2f, [512]]           # 24


head:
  - [[18, 21, 24], 1, Detect, [nc]]
