nc: 3
ch: 1

backbone:
  - [-1, 1, Conv, [32,3,2]]
  - [-1, 1, DSC2f, [64]]

  - [-1, 1, Conv, [128,3,2]]
  - [-1, 2, DSC2f, [128]]

  - [-1, 1, SimAM, [128]]
  - [-1, 1, FringeBlock, [128]]

  - [-1, 1, Conv, [256,3,2]]
  - [-1, 2, DSC2f, [256]]

  - [-1, 1, Conv, [512,3,2]]
  - [-1, 1, DSC2f, [512]]

  - [-1, 1, SPPF, [512,5]]

head:
  - [-1, 1, Conv, [256,1,1]]
  - [-1, 1, nn.Upsample, [None,2,nearest]]
  - [[-1,7], 1, Concat, [1]]
  - [-1, 2, DSC2f, [256]]

  - [-1, 1, Conv, [128,1,1]]
  - [-1, 1, nn.Upsample, [None,2,nearest]]
  - [[-1,3], 1, Concat, [1]]
  - [-1, 2, DSC2f, [128]]

  - [-1, 1, Conv, [128,3,2]]
  - [[-1,14], 1, Concat, [1]]
  - [-1, 2, DSC2f, [256]]

  - [[17,20,23], 1, Detect, [nc]]
